Revit 2022 API
StructuralSettings.AnalyticalModelCheckAdjustment Property
 Whether to check for analytical model distance from default location is larger than the tolerance defined by the property AnalyticalModelAdjustmentTolerance.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2011
Syntax
C#
public bool AnalyticalModelCheckAdjustment { get; set; }
Visual Basic
Public Property AnalyticalModelCheckAdjustment As Boolean
	Get
	Set
Visual C++
public:
property bool AnalyticalModelCheckAdjustment {
	bool get ();
	void set (bool value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
See Also
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace